Week11/Day52/projects/app/controllers/comments_controller.rb

  def create
    @discussion = Discussion.find(params[:discussion_id])
    @comment = @discussion.comments.new(comment_params)
    if @comment.save
---
SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "commentable_type", "commentable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "What a great day!"], ["commentable_type", "Discussion"], ["commentable_id", 1], ["created_at", "2021-07-06 21:32:54.137312"], ["updated_at", "2021-07-06 21:32:54.137312"]]