Week11/Day54/projects/app/views/projects/show.html.erb

<ul>
  <% @project.discussions.each do |discussion| %>
---
SELECT "discussions".* FROM "discussions" WHERE "discussions"."project_id" = ?  [["project_id", 1]]