Week11/Day53/projects/app/controllers/discussions_controller.rb

SELECT "discussions".* FROM "discussions"
---
  def index
    @discussions = Discussion.all

SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @discussion = Discussion.find(params[:id])